# Tap tap tap
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # macOS ones are outdated
brew 'duf'
brew 'fnm'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'openfortivpn'
brew 'pinentry-mac'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'terraform'
brew 'thefuck'
brew 'trash'
brew 'tree'
brew 'xsv'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Development
# brew 'mysql' # should be covered by herd @todo test on fresh machine
brew 'node'
# brew 'php' # should be covered by herd @todo test on fresh machine
brew 'pickle'
brew 'pnpm'
brew 'redis'

# Image optimization
brew 'ffmpeg'
brew 'guetzli'
brew 'webp'

# Various
brew 'lychee'
brew 'tldr'
brew 'youtube-dl'

# Apps
cask '8bitdo-ultimate-software'
cask 'arc'
cask 'balance-lock'
cask 'boop'
cask 'brave-browser'
cask 'cheatsheet'
cask 'chromium'
cask 'cog'
cask 'craft'
cask 'db-browser-for-sqlite'
cask 'dbngin'
cask 'dropbox'
cask 'elmedia-player'
cask 'epic-games'
cask 'figma'
cask 'firefox'
cask 'flameshot'
cask 'freac'
cask 'gitbutler'
cask 'gitup'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'gpg-suite' # once installed, activate use-agent in `~/.gnupg/gpg.confg`
cask 'grandperspective'
cask 'handbrake'
cask 'hazeover'
cask 'herd'
cask 'hush'
cask 'hyper'
cask 'idagio'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'joshjon-nocturnal'
cask 'kap'
cask 'keeweb'
cask 'keycastr'
cask 'krita'
cask 'linear-linear'
cask 'maccy'
cask 'macwhisper'
cask 'microsoft-edge'
cask 'min'
cask 'monitorcontrol'
cask 'moom'
cask 'mumble'
cask 'netnewswire'
cask 'nuclear'
cask 'nucleo'
cask 'numi'
cask 'openinterminal'
cask 'openmtp'
cask 'opera'
cask 'opera-neon'
cask 'oryoki'
cask 'phpmon'
cask 'pika'
cask 'plug'
cask 'raycast'
cask 'rightfont'
cask 'sensiblesidebuttons'
cask 'sequel-ace'
cask 'slack'
cask 'stand'
cask 'standard-notes'
cask 'staruml'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'thorium'
cask 'thunderbird'
cask 'touch-bar-simulator'
cask 'touchswitcher'
cask 'transmit'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vscodium'
cask 'wwdc'
cask 'xld'
cask 'zed'
cask 'zeplin'

# App Store apps
mas 'Flow', id: 1423210932
mas 'Focalboard', id: 1556908618
