# Tap tap tap
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # macOS ones are outdated
brew 'git'
brew 'grep'
brew 'gnupg'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'fzf'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'node'

# Image optimization
brew 'ffmpeg'
brew 'guetzli'
brew 'webp'

# Various
brew 'tldr'
brew 'youtube-dl'

# Apps
cask 'contraste'
cask 'dash'
cask 'day-o'
cask 'dropbox'
cask 'elmedia-player'
cask 'figma'
cask 'firefox'
cask 'gog-galaxy'
cask 'gitup'
cask 'google-chrome'
cask 'handbrake'
cask 'hazeover'
cask 'hyper'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'keeweb'
cask 'krita'
cask 'min'
cask 'microsoft-edge'
cask 'monitorcontrol'
cask 'moom'
cask 'now'
cask 'numi'
cask 'nuclear'
cask 'openinterminal'
cask 'opera'
cask 'opera-neon'
cask 'oryoki'
cask 'postbox'
cask 'rightfont'
cask 'sequel-pro'
cask 'slack'
cask 'sketch'
cask 'standard-notes'
cask 'staruml'
cask 'sublime-text'
cask 'telegram'
cask 'touchswitcher'
cask 'typora'
cask 'transmit'
cask 'usage'
cask 'vivaldi'
cask 'vox'
cask 'vscodium'
cask 'zeplin'

# App Store apps
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353
