# Tap tap tap
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # macOS ones are outdated
brew 'duf'
brew 'git'
brew 'grep'
brew 'gnupg'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'thefuck'
brew 'trash'
brew 'tree'
brew 'fzf'
brew 'xsv'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'node'
brew 'redis'

# Image optimization
brew 'ffmpeg'
brew 'guetzli'
brew 'webp'

# Various
brew 'tldr'
brew 'youtube-dl'

# Apps
cask '8bitdo-ultimate-software'
cask 'android-file-transfer'
cask 'ballast'
cask 'balance-lock'
cask 'boop'
cask 'brave-browser'
cask 'cheatsheet'
cask 'chromium'
cask 'cog'
cask 'craft'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'dropbox'
cask 'elmedia-player'
cask 'epic-games'
cask 'figma'
cask 'firefox'
cask 'gog-galaxy'
cask 'gitup'
cask 'google-chrome'
cask 'guijs'
cask 'handbrake'
cask 'hazeover'
cask 'hush'
cask 'hyper'
cask 'idagio'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'joshjon-nocturnal'
cask 'kap'
cask 'keeweb'
cask 'krita'
cask 'linear-linear'
cask 'maccy'
cask 'min'
cask 'microsoft-edge'
cask 'monitorcontrol'
cask 'moom'
cask 'mumble'
cask 'now'
cask 'numi'
cask 'nuclear'
cask 'nucleo'
cask 'openinterminal'
cask 'openmtp'
cask 'opera'
cask 'opera-neon'
cask 'oryoki'
cask 'pika'
cask 'plug'
cask 'postbox'
cask 'raycast'
cask 'rightfont'
cask 'sensiblesidebuttons'
cask 'sequel-pro'
cask 'slack'
cask 'stand'
cask 'standard-notes'
cask 'staruml'
cask 'sublime-text'
cask 'telegram'
cask 'thorium'
cask 'touchswitcher'
cask 'typora'
cask 'transmit'
cask 'vivaldi'
cask 'vscodium'
cask 'xld'
cask 'zeplin'

# App Store apps
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353
